hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/RF_LIB/inc/hw_gpio.h
// Field:     [6] DIO6
//
// Set bit 6
#define GPIO_DOUTSET31_0_DIO6                                       0x00000040
#define GPIO_DOUTSET31_0_DIO6_BITN                                           6
#define GPIO_DOUTSET31_0_DIO6_M                                     0x00000040
#define GPIO_DOUTSET31_0_DIO6_S                                              6

// Field:     [5] DIO5
//
// Set bit 5
#define GPIO_DOUTSET31_0_DIO5                                       0x00000020
#define GPIO_DOUTSET31_0_DIO5_BITN                                           5
#define GPIO_DOUTSET31_0_DIO5_M                                     0x00000020
#define GPIO_DOUTSET31_0_DIO5_S                                              5

// Field:     [4] DIO4
//
// Set bit 4
#define GPIO_DOUTSET31_0_DIO4                                       0x00000010
#define GPIO_DOUTSET31_0_DIO4_BITN                                           4
#define GPIO_DOUTSET31_0_DIO4_M                                     0x00000010
#define GPIO_DOUTSET31_0_DIO4_S                                              4

// Field:     [3] DIO3
//
// Set bit 3
#define GPIO_DOUTSET31_0_DIO3                                       0x00000008
#define GPIO_DOUTSET31_0_DIO3_BITN                                           3
#define GPIO_DOUTSET31_0_DIO3_M                                     0x00000008
#define GPIO_DOUTSET31_0_DIO3_S                                              3

// Field:     [2] DIO2
//
// Set bit 2
#define GPIO_DOUTSET31_0_DIO2                                       0x00000004
#define GPIO_DOUTSET31_0_DIO2_BITN                                           2
#define GPIO_DOUTSET31_0_DIO2_M                                     0x00000004
#define GPIO_DOUTSET31_0_DIO2_S                                              2

// Field:     [1] DIO1
//
// Set bit 1
#define GPIO_DOUTSET31_0_DIO1                                       0x00000002
#define GPIO_DOUTSET31_0_DIO1_BITN                                           1
#define GPIO_DOUTSET31_0_DIO1_M                                     0x00000002
#define GPIO_DOUTSET31_0_DIO1_S                                              1

// Field:     [0] DIO0
//
// Set bit 0
#define GPIO_DOUTSET31_0_DIO0                                       0x00000001
#define GPIO_DOUTSET31_0_DIO0_BITN                                           0
#define GPIO_DOUTSET31_0_DIO0_M                                     0x00000001
#define GPIO_DOUTSET31_0_DIO0_S                                              0

//*****************************************************************************
//
// Register: GPIO_O_DOUTCLR31_0
//
//*****************************************************************************
// Field:    [31] DIO31
//
// Clears bit 31
#define GPIO_DOUTCLR31_0_DIO31                                      0x80000000
#define GPIO_DOUTCLR31_0_DIO31_BITN                                         31
#define GPIO_DOUTCLR31_0_DIO31_M                                    0x80000000
#define GPIO_DOUTCLR31_0_DIO31_S                                            31

// Field:    [30] DIO30
//
// Clears bit 30
#define GPIO_DOUTCLR31_0_DIO30                                      0x40000000
#define GPIO_DOUTCLR31_0_DIO30_BITN                                         30
#define GPIO_DOUTCLR31_0_DIO30_M                                    0x40000000
#define GPIO_DOUTCLR31_0_DIO30_S                                            30

// Field:    [29] DIO29
//
// Clears bit 29
#define GPIO_DOUTCLR31_0_DIO29                                      0x20000000
#define GPIO_DOUTCLR31_0_DIO29_BITN                                         29
#define GPIO_DOUTCLR31_0_DIO29_M                                    0x20000000
#define GPIO_DOUTCLR31_0_DIO29_S                                            29

// Field:    [28] DIO28
//
// Clears bit 28
#define GPIO_DOUTCLR31_0_DIO28                                      0x10000000
#define GPIO_DOUTCLR31_0_DIO28_BITN                                         28
#define GPIO_DOUTCLR31_0_DIO28_M                                    0x10000000
#define GPIO_DOUTCLR31_0_DIO28_S                                            28

// Field:    [27] DIO27
//
// Clears bit 27
#define GPIO_DOUTCLR31_0_DIO27                                      0x08000000
#define GPIO_DOUTCLR31_0_DIO27_BITN                                         27
#define GPIO_DOUTCLR31_0_DIO27_M                                    0x08000000
#define GPIO_DOUTCLR31_0_DIO27_S                                            27

// Field:    [26] DIO26
//
// Clears bit 26
#define GPIO_DOUTCLR31_0_DIO26                                      0x04000000
#define GPIO_DOUTCLR31_0_DIO26_BITN                                         26
#define GPIO_DOUTCLR31_0_DIO26_M                                    0x04000000
#define GPIO_DOUTCLR31_0_DIO26_S                                            26

// Field:    [25] DIO25
//
// Clears bit 25
#define GPIO_DOUTCLR31_0_DIO25                                      0x02000000
#define GPIO_DOUTCLR31_0_DIO25_BITN                                         25
#define GPIO_DOUTCLR31_0_DIO25_M                                    0x02000000
#define GPIO_DOUTCLR31_0_DIO25_S                                            25

// Field:    [24] DIO24
//
// Clears bit 24
#define GPIO_DOUTCLR31_0_DIO24                                      0x01000000
#define GPIO_DOUTCLR31_0_DIO24_BITN                                         24
#define GPIO_DOUTCLR31_0_DIO24_M                                    0x01000000
#define GPIO_DOUTCLR31_0_DIO24_S                                            24

// Field:    [23] DIO23
//
// Clears bit 23
#define GPIO_DOUTCLR31_0_DIO23                                      0x00800000
#define GPIO_DOUTCLR31_0_DIO23_BITN                                         23
#define GPIO_DOUTCLR31_0_DIO23_M                                    0x00800000
#define GPIO_DOUTCLR31_0_DIO23_S                                            23

// Field:    [22] DIO22
//
// Clears bit 22
#define GPIO_DOUTCLR31_0_DIO22                                      0x00400000
#define GPIO_DOUTCLR31_0_DIO22_BITN                                         22
#define GPIO_DOUTCLR31_0_DIO22_M                                    0x00400000
#define GPIO_DOUTCLR31_0_DIO22_S                                            22

// Field:    [21] DIO21
//
// Clears bit 21
#define GPIO_DOUTCLR31_0_DIO21                                      0x00200000
#define GPIO_DOUTCLR31_0_DIO21_BITN                                         21
#define GPIO_DOUTCLR31_0_DIO21_M                                    0x00200000
#define GPIO_DOUTCLR31_0_DIO21_S                                            21

// Field:    [20] DIO20
//
// Clears bit 20
#define GPIO_DOUTCLR31_0_DIO20                                      0x00100000
#define GPIO_DOUTCLR31_0_DIO20_BITN                                         20
#define GPIO_DOUTCLR31_0_DIO20_M                                    0x00100000
#define GPIO_DOUTCLR31_0_DIO20_S                                            20

